// 1. Создать базовый массив
// 2. Создать основной массив
// 3. Заполнить основной массив случайными элементами из базового
// 4. Решить основную задачу (по блок-схеме)
// 5. Вывести результат в консоль

string[] baseArray = new string[]
{
    "Самара", "Омск", "Казань", "Челябинск", "Ростов-на-Дону", "Уфа",
    "Волгоград", "Пермь", "арм", "бел", "боп", "газ", "дук", "ева",
    "зов", "орс", "чаж", "эра", "Красноярск", "Воронеж", "Саратов",
    "Краснодар", "Тольятти", "Ижевск", "Ульяновск", "Барнаул",
    "Владивосток", "бег", "гад", "ира", "лях", "мит", "мод", "сад",
    "уок", "хек", "циф", "аш", "ло", "но", "од", "он", "ра", "ре",
    "хи", "цы", "ял", "Томск", "Пенза", "Липецк", "Тула", "Киров",
    "Брянск", "Курск", "Иваново", "Сочи", "Курган", "Смоленск"
};

